learnwithme/app/controllers/courses_controller.rb

INSERT INTO "courses" ("title", "short_desc", "long_desc", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Donkey"], ["short_desc", ""], ["long_desc", ""], ["location", ""], ["created_at", "2015-07-18 10:07:02.098739"], ["updated_at", "2015-07-18 10:07:02.098739"]]
---
  def create
    @course = Course.new(course_params)
    @course.owner = current_user
    if @course.save