learnwithme/app/controllers/sheets_controller.rb

  def new
    @sheet = Sheet.new
    @course = Course.find(params[:course_id]) if params[:course_id]
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]